[Killed] ObjectLiteral
main/components/Articles/ArticlesTable.js:43:5
       accessor: "id", // accessor is the "key" in the data
     },
 
-    {
-      Header: "Title",
-      accessor: "title",
-    },
+    {},
     {
       Header: "Url",
killedBy: ArticlesIndexPage tests Renders with Create Button for admin user
statusReason: Error: A column ID (or string accessor) is required!
