[Killed] BlockStatement
main/pages/Articles/ArticlesCreatePage.js:20:34
     },
   });
 
-  const onSuccess = (article) => {
-    toast(`New Article created - id: ${article.id} title: ${article.title}`);
-  };
+  const onSuccess = (article) => {};
 
   const mutation = useBackendMutation(
killedBy: ArticlesCreatePage tests on submit, makes request to backend, and redirects to /articles
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New Article created - id: 3 title: CSS Grid Layout"

Number of calls: 0
