[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestEditPage.js:44:38
     },
   });
 
-  const onSuccess = (helpRequest) => {
-    toast(
-      `Help Request Updated - id: ${helpRequest.id} Team ID: ${helpRequest.teamId}`,
-    );
-  };
+  const onSuccess = (helpRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />
