[Killed] ArrowFunction
main/pages/MenuItemReview/MenuItemReviewCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function MenuItemReviewCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (menuItemReview) => ({
-    url: "/api/menuitemreviews/post",
-    method: "POST",
-    params: {
-      itemId: menuItemReview.itemId,
-      reviewerEmail: menuItemReview.reviewerEmail,
-      stars: menuItemReview.stars,
-      dateReviewed: menuItemReview.dateReviewed,
-      comments: menuItemReview.comments,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (menuItemReview) => {
killedBy: MenuItemReviewCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />
