[Killed] ConditionalExpression
main/components/RecommendationRequests/RecommendationRequestForm.js:33:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Col>
-          <Form.Group className="mb-3">
-            <Form.Label htmlFor="id">Id</Form.Label>
-            <Form.Control
-              data-testid={testIdPrefix + "-id"}
-              id="id"
-              type="text"
-              {...register("id")}
-              value={initialContents.id}
-              disabled
-            />
-          </Form.Group>
-        </Col>
-      )}
+      {true}
       <Row>
         <Col>
killedBy: RecommendationRequestForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="RecommendationRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/RecommendationRequests/RecommendationRequestForm.js:33:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Col>
-          <Form.Group className="mb-3">
-            <Form.Label htmlFor="id">Id</Form.Label>
-            <Form.Control
-              data-testid={testIdPrefix + "-id"}
-              id="id"
-              type="text"
-              {...register("id")}
-              value={initialContents.id}
-              disabled
-            />
-          </Form.Group>
-        </Col>
-      )}
+      {initialContents || <Col>
+          <Form.Group className="mb-3">
+            <Form.Label htmlFor="id">Id</Form.Label>
+            <Form.Control data-testid={testIdPrefix + "-id"} id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+          </Form.Group>
+        </Col>}
       <Row>
         <Col>
killedBy: RecommendationRequestForm tests renders correctly with no initialContents
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Killed] StringLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:59:29
                 type="text"
                 isInvalid={Boolean(errors.requesterEmail)}
                 {...register("requesterEmail", {
-                  required: "Requester Email is required",
+                  required: "",
                 })}
               />
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: Error: Unable to find an element with the text: /Requester Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/RecommendationRequests/RecommendationRequestForm.js:75:48
                 id="professorEmail"
                 type="text"
                 isInvalid={Boolean(errors.professorEmail)}
-                {...register("professorEmail", {
-                  required: "Professor Email is required",
-                })}
+                {...register("professorEmail", {})}
               />
 
killedBy: RecommendationRequestForm tests that the correct validations are performed
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Professor Email is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
