[Killed] ArrowFunction
main/pages/RecommendationRequests/RecommendationRequestCreatePage.js:8:31
 import { toast } from "react-toastify";
 
 export default function RecommendationRequestCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (recommendationRequest) => ({
-    url: "/api/recommendationrequests/post",
-    method: "POST",
-    params: {
-      requesterEmail: recommendationRequest.requesterEmail,
-      professorEmail: recommendationRequest.professorEmail,
-      dateNeeded: recommendationRequest.dateNeeded,
-      dateRequested: recommendationRequest.dateRequested,
-      explanation: recommendationRequest.explanation,
-      done: recommendationRequest.done,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (recommendationRequest) => {
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/pages/RecommendationRequests/RecommendationRequestCreatePage.js:11:13
   const objectToAxiosParams = (recommendationRequest) => ({
     url: "/api/recommendationrequests/post",
     method: "POST",
-    params: {
-      requesterEmail: recommendationRequest.requesterEmail,
-      professorEmail: recommendationRequest.professorEmail,
-      dateNeeded: recommendationRequest.dateNeeded,
-      dateRequested: recommendationRequest.dateRequested,
-      explanation: recommendationRequest.explanation,
-      done: recommendationRequest.done,
-    },
+    params: {},
   });
 
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 8
+ Received  + 1

- Object {
-   "dateNeeded": "2024-11-21T01:08",
-   "dateRequested": "2024-10-30T01:08",

[Killed] BlockStatement
main/pages/RecommendationRequests/RecommendationRequestCreatePage.js:21:48
     },
   });
 
-  const onSuccess = (recommendationRequest) => {
-    toast(
-      `New recommendationRequest Created - id: ${recommendationRequest.id} ` +
-        `requesterEmail: ${recommendationRequest.requesterEmail} professorEmail: ${recommendationRequest.professorEmail} ` +
-        `dateNeeded: ${recommendationRequest.dateNeeded} dateRequested: ${recommendationRequest.dateRequested} ` +
-        `explanation: ${recommendationRequest.explanation} done: ${recommendationRequest.done}`,
-    );
-  };
+  const onSuccess = (recommendationRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New recommendationRequest Created - id: 0 requesterEmail: prof@ucsb.edu professorEmail: stud@ucsb.edu dateNeeded: 2024-11-21T01:08 dateRequested: 2024-10-30T01:08 explanation: I need to get into grad school! done: true"

Number of calls: 0

[Killed] StringLiteral
main/pages/RecommendationRequests/RecommendationRequestCreatePage.js:23:7
 
   const onSuccess = (recommendationRequest) => {
     toast(
-      `New recommendationRequest Created - id: ${recommendationRequest.id} ` +
+      `` +
         `requesterEmail: ${recommendationRequest.requesterEmail} professorEmail: ${recommendationRequest.professorEmail} ` +
         `dateNeeded: ${recommendationRequest.dateNeeded} dateRequested: ${recommendationRequest.dateRequested} ` +
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New recommendationRequest Created - id: 0 requesterEmail: prof@ucsb.edu professorEmail: stud@ucsb.edu dateNeeded: 2024-11-21T01:08 dateRequested: 2024-10-30T01:08 explanation: I need to get into grad school! done: true"
Received: "requesterEmail: prof@ucsb.edu professorEmail: stud@ucsb.edu dateNeeded: 2024-11-21T01:08 dateRequested:

[Killed] StringLiteral
main/pages/RecommendationRequests/RecommendationRequestCreatePage.js:25:9
     toast(
       `New recommendationRequest Created - id: ${recommendationRequest.id} ` +
         `requesterEmail: ${recommendationRequest.requesterEmail} professorEmail: ${recommendationRequest.professorEmail} ` +
-        `dateNeeded: ${recommendationRequest.dateNeeded} dateRequested: ${recommendationRequest.dateRequested} ` +
+        `` +
         `explanation: ${recommendationRequest.explanation} done: ${recommendationRequest.done}`,
     );
killedBy: RecommendationRequestCreatePage tests on submit, makes request to backend, and redirects to /recommendationrequests
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New recommendationRequest Created - id: 0 requesterEmail: prof@ucsb.edu professorEmail: stud@ucsb.edu dateNeeded: 2024-11-21T01:08 dateRequested: 2024-10-30T01:08 explanation: I need to get into grad school! done: true"
Received: "New recommendationRequest Created - id: 0 requesterEmail: prof@ucsb.edu professorEmail: stud@ucsb.edu ex
