[Killed] BlockStatement
main/pages/RecommendationRequests/RecommendationRequestEditPage.js:28:61
     },
   );
 
-  const objectToAxiosPutParams = (recommendationRequest) => {
-    let data = {};
-    Object.assign(data, recommendationRequest);
-    delete data.id;
-    return {
-      url: "/api/recommendationrequests",
-      method: "PUT",
-      params: {
-        id: recommendationRequest.id,
-      },
-      data: data,
-    };
-  };
+  const objectToAxiosPutParams = (recommendationRequest) => {};
 
   const onSuccess = (recommendationRequest) => {
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "RecommendationRequest Updated - id: 0 requesterEmail: prof@ucsb.edu professorEmail: stud@ucsb.edu dateNeeded: 2024-11-21T01:08 dateRequested: 2024-10-30T01:08 explanation: I don't know actually done: true"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 40

[Killed] ObjectLiteral
main/pages/RecommendationRequests/RecommendationRequestEditPage.js:32:12
     let data = {};
     Object.assign(data, recommendationRequest);
     delete data.id;
-    return {
-      url: "/api/recommendationrequests",
-      method: "PUT",
-      params: {
-        id: recommendationRequest.id,
-      },
-      data: data,
-    };
+    return {};
   };
 
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "RecommendationRequest Updated - id: 0 requesterEmail: prof@ucsb.edu professorEmail: stud@ucsb.edu dateNeeded: 2024-11-21T01:08 dateRequested: 2024-10-30T01:08 explanation: I don't know actually done: true"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 40

[Killed] BlockStatement
main/pages/RecommendationRequests/RecommendationRequestEditPage.js:42:48
     };
   };
 
-  const onSuccess = (recommendationRequest) => {
-    toast(
-      `RecommendationRequest Updated - id: ${recommendationRequest.id} ` +
-        `requesterEmail: ${recommendationRequest.requesterEmail} professorEmail: ${recommendationRequest.professorEmail} ` +
-        `dateNeeded: ${recommendationRequest.dateNeeded} dateRequested: ${recommendationRequest.dateRequested} ` +
-        `explanation: ${recommendationRequest.explanation} done: ${recommendationRequest.done}`,
-    );
-  };
+  const onSuccess = (recommendationRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: RecommendationRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />
