[Killed] ArrayDeclaration
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsTable.js:36:19
     deleteMutation.mutate(cell);
   };
 
-  const columns = [
-    {
-      Header: "id",
-      accessor: "id", // accessor is the "key" in the data
-    },
-    {
-      Header: "Dining Commons Code",
-      accessor: "diningCommonsCode",
-    },
-    {
-      Header: "Name",
-      accessor: "name",
-    },
-    {
-      Header: "Station",
-      accessor: "station",
-    },
-  ];
+  const columns = [];
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsTable.js:55:43
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(
-      ButtonColumn(
-        "Edit",
-        "primary",
-        editCallback,
-        "UCSBDiningCommonsMenuItemsTable",
-      ),
-    );
-    columns.push(
-      ButtonColumn(
-        "Delete",
-        "danger",
-        deleteCallback,
-        "UCSBDiningCommonsMenuItemsTable",
-      ),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
   return (
killedBy: UCSBDiningCommonsMenuItemsIndexPage tests what happens when you click delete, admin
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemsTable-cell-row-0-col-Delete-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsTable.js:61:9
         "Edit",
         "primary",
         editCallback,
-        "UCSBDiningCommonsMenuItemsTable",
+        "",
       ),
     );
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemsTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
