[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsCreatePage.js:10:31
 export default function UCSBDiningCommonsMenuItemsCreatePage({
   storybook = false,
 }) {
-  const objectToAxiosParams = (ucsbDiningCommonsMenuItems) => ({
-    url: "/api/ucsbdiningcommonsmenuitems/post",
-    method: "POST",
-    params: {
-      diningCommonsCode: ucsbDiningCommonsMenuItems.diningCommonsCode,
-      name: ucsbDiningCommonsMenuItems.name,
-      station: ucsbDiningCommonsMenuItems.station,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (ucsbDiningCommonsMenuItems) => {
killedBy: UCSBDiningCommonsMenuItemsCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsCreatePage.js:13:13
   const objectToAxiosParams = (ucsbDiningCommonsMenuItems) => ({
     url: "/api/ucsbdiningcommonsmenuitems/post",
     method: "POST",
-    params: {
-      diningCommonsCode: ucsbDiningCommonsMenuItems.diningCommonsCode,
-      name: ucsbDiningCommonsMenuItems.name,
-      station: ucsbDiningCommonsMenuItems.station,
-    },
+    params: {},
   });
 
killedBy: UCSBDiningCommonsMenuItemsCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 5
+ Received  + 1

- Object {
-   "diningCommonsCode": "Portola",
-   "name": "Pasta",

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsCreatePage.js:20:53
     },
   });
 
-  const onSuccess = (ucsbDiningCommonsMenuItems) => {
-    toast(
-      `New ucsbDiningCommonsMenuItems Created - id: ${ucsbDiningCommonsMenuItems.id} name: ${ucsbDiningCommonsMenuItems.name}`,
-    );
-  };
+  const onSuccess = (ucsbDiningCommonsMenuItems) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemsCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "New ucsbDiningCommonsMenuItems Created - id: 17 name: Pasta"

Number of calls: 0
