[Killed] BooleanLiteral
main/pages/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsEditPage.js:9:15
 import { toast } from "react-toastify";
 
 export default function UCSBDiningCommonsMenuItemsEditPage({
-  storybook = false,
+  storybook = true,
 }) {
   let { id } = useParams();
killedBy: UCSBDiningCommonsMenuItemsEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: {"to": "/ucsbdiningcommonsmenuitems"}

Number of calls: 0

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsEditPage.js:20:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/ucsbdiningcommonsmenuitems?id=${id}`],
-    {
-      // Stryker disable next-line all : GET is the default, so changing this to "" doesn't introduce a bug
-      method: "GET",
-      url: `/api/ucsbdiningcommonsmenuitems`,
-      params: {
-        id,
-      },
-    },
+    {},
   );
 
killedBy: UCSBDiningCommonsMenuItemsEditPage tests tests where backend is working normally renders without crashing
statusReason: Error: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemsForm-diningCommonsCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsEditPage.js:30:34
     },
   );
 
-  const objectToAxiosPutParams = (ucsbDiningCommonsMenuItems) => ({
-    url: "/api/ucsbdiningcommonsmenuitems",
-    method: "PUT",
-    params: {
-      id: ucsbDiningCommonsMenuItems.id,
-    },
-    data: {
-      diningCommonsCode: ucsbDiningCommonsMenuItems.diningCommonsCode,
-      name: ucsbDiningCommonsMenuItems.name,
-      station: ucsbDiningCommonsMenuItems.station,
-    },
-  });
+  const objectToAxiosPutParams = () => undefined;
 
   const onSuccess = (ucsbDiningCommonsMenuItems) => {
killedBy: UCSBDiningCommonsMenuItemsEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalledWith(...expected)

Expected: "UCSBDiningCommonsMenuItems Updated - id: 17 name: Pasta"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] ObjectLiteral
main/pages/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsEditPage.js:36:11
     params: {
       id: ucsbDiningCommonsMenuItems.id,
     },
-    data: {
-      diningCommonsCode: ucsbDiningCommonsMenuItems.diningCommonsCode,
-      name: ucsbDiningCommonsMenuItems.name,
-      station: ucsbDiningCommonsMenuItems.station,
-    },
+    data: {},
   });
 
killedBy: UCSBDiningCommonsMenuItemsEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "{\"diningCommonsCode\":\"Portola\",\"name\":\"Pasta\",\"station\":\"Brick\"}"
Received: "{}"

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsEditPage.js:43:53
     },
   });
 
-  const onSuccess = (ucsbDiningCommonsMenuItems) => {
-    toast(
-      `UCSBDiningCommonsMenuItems Updated - id: ${ucsbDiningCommonsMenuItems.id} name: ${ucsbDiningCommonsMenuItems.name}`,
-    );
-  };
+  const onSuccess = (ucsbDiningCommonsMenuItems) => {};
 
   const mutation = useBackendMutation(
killedBy: UCSBDiningCommonsMenuItemsEditPage tests tests where backend is working normally Changes when you click Update
statusReason: Error: expect(jest.fn()).toBeCalled()

Expected number of calls: >= 1
Received number of calls:    0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/pages/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsEditPage.js:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBDiningCommonsMenuItems</h1>
-        {ucsbDiningCommonsMenuItems && (
-          <UCSBDiningCommonsMenuItemsForm
-            initialContents={ucsbDiningCommonsMenuItems}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: UCSBDiningCommonsMenuItemsEditPage tests tests where backend is working normally renders without crashing
statusReason: Error: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemsForm-diningCommonsCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsEditPage.js:70:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit UCSBDiningCommonsMenuItems</h1>
-        {ucsbDiningCommonsMenuItems && (
-          <UCSBDiningCommonsMenuItemsForm
-            initialContents={ucsbDiningCommonsMenuItems}
-            submitAction={onSubmit}
-            buttonLabel="Update"
-          />
-        )}
+        {ucsbDiningCommonsMenuItems || <UCSBDiningCommonsMenuItemsForm initialContents={ucsbDiningCommonsMenuItems} submitAction={onSubmit} buttonLabel="Update" />}
       </div>
     </BasicLayout>
killedBy: UCSBDiningCommonsMenuItemsEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <input class="form-control" data-testid="UCSBDiningCommonsMenuItemsForm-diningCommonsCode" id="diningCommonsCode" name="diningCommonsCode" type="text" /> instead
