[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.js:74:38
               id="teamId"
               type="text"
               isInvalid={Boolean(errors.teamId)}
-              {...register("teamId", {
-                required: "The teamId is required",
-              })}
+              {...register("teamId", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /The teamId is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequests/HelpRequestForm.js:122:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requestTime && "The request time is required"}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Error: Unable to find an element with the text: /The request time is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/HelpRequests/HelpRequestForm.js:122:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.requestTime && "The request time is required"}
+              {errors.requestTime || "The request time is required"}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.js:137:43
               id="explanation"
               type="text"
               isInvalid={Boolean(errors.explanation)}
-              {...register("explanation", {
-                required: "The explanation is required",
-              })}
+              {...register("explanation", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /The explanation is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
