[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewTable.js:40:17
     },
     {
       Header: "Item Id",
-      accessor: "itemId",
+      accessor: "",
     },
     {
killedBy: UserTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="MenuItemReviewTable-cell-row-0-col-itemId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
