[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.js:20:24
 
   const navigate = useNavigate();
 
-  const testIdPrefix = "UCSBOrganizationsForm";
+  const testIdPrefix = "";
 
   return (
killedBy: UCSBOrganizationsForm tests renders correctly when passing in initialContents
statusReason: Error: Unable to find an element by: [data-testid="UCSBOrganizationsForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
