[Killed] StringLiteral
src/main/utils/MenuItemReviewUtils.js:11:13
 export function cellToAxiosParamsDelete(cell) {
   return {
     url: "/api/menuitemreviews",
-    method: "DELETE",
+    method: "",
     params: {
       id: cell.row.values.id,
killedBy: MenuItemReviewUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "method": "DELETE",
+   "method": "",
